package kr.co.exam04;

public class Exam {

	public static void main(String[] args) {
		/*
		 * 학생들의 성적을 관리하기 위한 용도의 클래스를 생성하세요.
		 * 	  학생 클래스
		 *       멤버변수 : 과목클래스배열, 이름, 학년
		 *       멤버메서드 : 과목추가, 과목점수수정, 과목삭제, 성적표출력
		 *       
		 *    과목 클래스
		 *       멤버변수 : 과목명, 점수, 등급
		 *       멤버메서드 : 점수로 등급을 산출하기 위한 메서드   
		 *       
		 * 학생 성적을 관리하기 위해서 추가적으로 필요한 멤버변수/멤버메서드가 있으면 더 작성.      
		 */
		
		
		//Run r= new Run();
		//r.start();
		
		Run2 r = new Run2();
		r.start();
		
		/*
		 * 리튬전지배터리
		 *    속성 : 기존용량, 완충횟수, 최대완충가능횟수, 사용가능용량
		 *    기능 : 충전, 방전
		 *    
		 * 리튬전지배터리의 1번 방전 후 완충을 진행 했을 때 기존 용량 대비 0.02% 용량이 감소
		 * 한다고 한다. 완전방전을 100번 했을 때, 200번 했을 때, 300번 했을 때 각각의 
		 * 사용 가능한 용량이 어떻게 되는지 이를 프로그램에서 구현하여 시뮬레이션 해보세요.
		 * 충/방전을 반복하여 기존용량 대비 사용가능용량이 40% 되는 시점을 최대완충가능횟수로 설정.
		 * 
		 * 일부 사용자들은 완전방전을 20% 확률로 수행한다고 가정 했을 때의 최대완충가능횟수도
		 * 구하세요. (완전방전을 하지 않은 경우 용량감소는 이뤄지지 않습니다.)
		 */

	}

}
